[
  {
    "title": "India-Pakistan tensions: Amritsar district admin issues safety advisory, asks people to stay indoors",
    "description": "The Amritsar district administration has issued a safety advisory urging residents to stay indoors, keep lights off, and avoid windows amid a heightened security alert. The advisory also asks residents to avoid stepping onto roads, balconies, or terraces and to remain calm.",
    "url": "https://www.indiatvnews.com/news/india/india-pakistan-tensions-amritsar-district-admin-issues-safety-advisory-asks-people-to-stay-indoors-security-alert-2025-05-11-989743",
    "publishedAt": "2025-05-11T00:16:37Z",
    "source": "India TV News",
    "content": "India-Pakistan tensions: Amritsar district admin issues safety advisory, asks people to stay indoors The Amritsar district administration has issued a safety advisory urging residents to stay indoors, keep lights off, and avoid windows amid a heighte... [1291 chars]"
  },
  {
    "title": "The Adolescence Effect: How teen boys are getting sucked into the manosphere",
    "description": "A psychologist at Delhi's Juvenile Justice Board II reveals alarming insights into the digital world's impact on teenagers, from hacking and bomb threats to toxic masculinity, online radicalization, and the dangers of the manosphere and looksmaxxing culture.",
    "url": "https://indianexpress.com/article/express-sunday-eye/the-adolescence-effect-how-teen-boys-are-getting-sucked-into-the-manosphere-9994125/",
    "publishedAt": "2025-05-11T00:00:01Z",
    "source": "The Indian Express",
    "content": "Student, 16: Aren’t you worried that I could break into your file system that you protect with your password, steal your records? For two years, the cops couldn’t catch me. This time a silly error got me here. But I have sent fake bomb threats over e... [13037 chars]"
  },
  {
    "title": "Pakistan’s ‘Firm’ Bunyan-un-Marsoos Crumbles As Missile-Drone Barrage Blown To Bits",
    "description": "Pakistan escalates military offensive against India under 'Bunyan-un-Marsoos'; drones and missiles intercepted by India, exposing Pakistan's hollow threats.",
    "url": "https://www.news18.com/world/pakistans-firm-bunyan-un-marsoos-crumbles-as-missile-drone-barrage-blown-to-bits-ws-kl-9331063.html",
    "publishedAt": "2025-05-10T04:37:02Z",
    "source": "News18",
    "content": "Pakistan’s ‘Firm’ Bunyan-un-Marsoos Crumbles As Missile-Drone Barrage Blown To Bits\nCurated By :\nNews18.com Edited By: Apoorva Misra\nLast Updated: May 10, 2025, 10:07 IST\nBy giving its military offensive the moniker, Pakistan seems to be making an at... [3122 chars]"
  },
  {
    "title": "Mother’s Day 2025: Why Working Moms Need Smarter Term Insurance Plans",
    "description": "Mother’s Day 2025: Term plans are evolving to support India’s working mothers—balancing ambition, caregiving, and long-term security",
    "url": "https://www.news18.com/business/savings-and-investments/mothers-day-2025-why-working-moms-need-smarter-term-insurance-plans-9331035.html",
    "publishedAt": "2025-05-10T04:00:35Z",
    "source": "News18",
    "content": "Mother’s Day 2025: Why Working Moms Need Smarter Term Insurance Plans\nPublished By :\nNews18.com\nLast Updated: May 10, 2025, 09:30 IST\nMother’s Day 2025: Term plans are evolving to support India’s working mothers—balancing ambition, caregiving, and lo... [3283 chars]"
  },
  {
    "title": "Ram Madhav writes: It’s time India framed a national security doctrine",
    "description": "The question is not whether we were able to thwart attacks effectively, but whether we can ensure that there won’t be any attacks at all",
    "url": "https://indianexpress.com/article/opinion/columns/ram-madhav-india-framed-national-security-doctrine-9993537/",
    "publishedAt": "2025-05-10T01:40:57Z",
    "source": "The Indian Express",
    "content": "“Doctrine” is a word mostly used in a theological sense. This word with roots in Christianity, meaning a set of beliefs or principles, has long entered military parlance. Most big countries have certain core principles that guide their military machi... [5512 chars]"
  },
  {
    "title": "India-Pakistan conflict LIVE: G7 countries condemn Pahalgam terror attack, urge immediate de-escalation",
    "description": "India-Pakistan conflict LIVE: PM Modi held a high-level meeting with External Affairs Minister S. Jaishankar and National Security Advisor Ajit Doval on Friday, following fresh attacks on Friday night. The G7 countries have issued a statement urging de-escalation amid rising tensions.",
    "url": "https://www.livemint.com/news/india/indiapakistan-conflict-live-urgent-media-briefing-scheduled-by-centre-in-delhi-at-5-45-am-11746835208415.html",
    "publishedAt": "2025-05-10T00:52:00Z",
    "source": "Livemint",
    "content": "India-Pakistan conflict LIVE: Prime Minister Narendra Modi held a high-level meeting with External Affairs Minister S. Jaishankar and National Security Advisor Ajit Doval on Friday, following a freesh wave of attacks launched by Pakistan.\nFor the sec... [1628 chars]"
  },
  {
    "title": "O P Jindal university shifts exams to online mode",
    "description": "In an email sent on Friday by the Registrar’s office, the university said the decision was taken “not due to any direct threat to campus safety, but as a proactive and precautionary step”.",
    "url": "https://indianexpress.com/article/cities/delhi/o-p-jindal-university-shifts-exams-to-online-mode-9993761/",
    "publishedAt": "2025-05-09T23:46:07Z",
    "source": "The Indian Express",
    "content": "In the email, the university clarified that students are not required to vacate campus and may choose to appear for online exams from their hostel rooms. (Express File Photo)\nIn light of the ongoing conflict between India and Pakistan, the O P Jindal... [618 chars]"
  },
  {
    "title": "Remain fully alert to deal with any crisis: FM Nirmala Sitharaman to banks amid India-Pakistan tensions",
    "description": "India-Pakistan tensions: Finance Minister Nirmala Sitharaman asked banks to remain fully alert to deal with any crisis and said that the Government of India is firmly committed to national security and economic stability.",
    "url": "https://www.livemint.com/industry/banking/fm-nirmala-sitharaman-asks-banks-to-remain-fully-alert-to-deal-with-any-crisis-amid-india-pakistan-tensions-11746798435216.html",
    "publishedAt": "2025-05-09T19:34:59Z",
    "source": "Livemint",
    "content": "Amid ongoing conflict with Pakistan, Union Finance Minister Nirmala Sitharaman on Friday asked banks to remain fully alert to deal with any crisis, and noted that the country’s banking and financial system remains robust and resilient.\nSitharaman mad... [2506 chars]"
  },
  {
    "title": "Why India's air defence is superior to Pakistan's",
    "description": "India’s S-400 can engage targets up to 400 km away and track 300 simultaneously. Backed by Akash, SPYDER and indigenous upgrades, it intercepted 80 per cent of simulated threats in trials. Pakistan’s HQ-9 and HQ-16, by comparison, offer lower range and fewer simultaneous engagements. On May 8, India foiled all attempted aerial incursions by Pakistan",
    "url": "https://www.firstpost.com/explainers/india-air-defence-compared-to-pakistan-operation-sindoor-13887034.html",
    "publishedAt": "2025-05-09T14:33:49Z",
    "source": "Firstpost",
    "content": "India’s air defence network—anchored by the S-400 Triumf, Akash and SPYDER systems — thwarted every Pakistani aerial attempt on Thursday night. With indigenous and imported technologies working in tandem, India now fields one of the most formidable m... [7468 chars]"
  },
  {
    "title": "Operation Sindoor: Kolkata Port Enhances Security Amid National Alert",
    "description": "Syama Prasad Mookerjee Port boosts security, cancels staff leave, and enhances cybersecurity. India bans Pakistan-flagged vessels at ports amid national tension.",
    "url": "https://www.news18.com/india/operation-sindoor-kolkata-port-enhances-security-amid-national-alert-ws-l-9330657.html",
    "publishedAt": "2025-05-09T14:32:16Z",
    "source": "News18",
    "content": "Operation Sindoor: Kolkata Port Enhances Security Amid National Alert\nReported By :\nNews18.com\nLast Updated: May 09, 2025, 20:02 IST\nChaired by Rathendra Raman, Chairman of SMPK, the meeting included key officials, including CISF and departmental hea... [2126 chars]"
  },
  {
    "title": "Tripura Reviews Indo-Bangladesh Border Security Amid Tension With Pakistan",
    "description": "Tripura CM Manik Saha held a security review meeting to enhance vigilance along the India-Bangladesh border, focusing on countering cross-border threats.",
    "url": "https://www.news18.com/india/tripura-reviews-indo-bangladesh-border-security-amid-tension-with-pakistan-ws-kl-9330607.html",
    "publishedAt": "2025-05-09T14:04:34Z",
    "source": "News18",
    "content": "Tripura Reviews Indo-Bangladesh Border Security Amid Tension With Pakistan\nReported By :\nNews18.com\nLast Updated: May 09, 2025, 19:34 IST\nSenior representatives from the Border Security Force (BSF), Assam Rifles, and various paramilitary and intellig... [2305 chars]"
  },
  {
    "title": "DDCA Alerted After Chilling Email Threatens Stadium Blast Linked To India-Pakistan Cross-Border Strife",
    "description": "Stadium blast threat linked to Indo-Pak tension alarms DDCA.",
    "url": "https://in.mashable.com/culture/94008/ddca-alerted-after-chilling-email-threatens-stadium-blast-linked-to-india-pakistan-cross-border-stri",
    "publishedAt": "2025-05-09T11:59:33Z",
    "source": "Mashable India",
    "content": "> Culture\nIn a troubling development on the morning of May 9, the Delhi and District Cricket Association (DDCA) found itself at the center of a security scare after receiving a chilling anonymous email. The message, which landed around 9 a.m., warned... [2827 chars]"
  },
  {
    "title": "COMEDK 2025 Exam Postponed In Select Centres Amid India-Pakistan Tensions",
    "description": "Due to national security measures under 'Operation Sindoor', COMEDK 2025 exams have been postponed in 14 districts across Gujarat, Haryana, J&K, Punjab, and Rajasthan. New dates will be announced. Exams in all other centres remain scheduled for May 10.",
    "url": "https://www.news18.com/education-career/comedk-2025-exam-postponed-in-select-centres-amid-india-pakistan-tensions-9330346.html",
    "publishedAt": "2025-05-09T11:19:42Z",
    "source": "News18",
    "content": "COMEDK 2025 Exam Postponed In Select Centres Amid India-Pakistan Tensions\nCurated By :\nNews18.com\nLast Updated: May 09, 2025, 16:49 IST\nThe COMEDK 2025 exam has been postponed in 14 districts due to national security concerns. New dates will be annou... [2254 chars]"
  },
  {
    "title": "Bomb Squads Deployed, Security Tightened In Arun Jaitley Stadium After Blast Threat",
    "description": "Bomb squads were deployed, and security tightened at Arun Jaitley Stadium in New Delhi after an anonymous bomb threat.",
    "url": "https://www.news18.com/cricket/bomb-squads-deployed-security-tightened-in-arun-jaitley-stadium-after-blast-threat-ws-l-9330256.html",
    "publishedAt": "2025-05-09T10:48:07Z",
    "source": "News18",
    "content": "Bomb Squads Deployed, Security Tightened In Arun Jaitley Stadium After Blast Threat\nReported By :\nNews18.com\nLast Updated: May 09, 2025, 16:18 IST\nBomb squads were deployed, and security tightened at Arun Jaitley Stadium in New Delhi after an anonymo... [2505 chars]"
  },
  {
    "title": "As India-Pak Tensions Rise, Centre Asks States To Activate Emergency Powers: What Does It Mean?",
    "description": "Union Ministry of Home Affairs directs states to invoke emergency powers under Civil Defence Rules, 1968, for quick response to heightened security threats.",
    "url": "https://www.news18.com/india/as-india-pak-tensions-rise-centre-asks-states-to-activate-emergency-powers-what-does-it-mean-ws-l-9330229.html",
    "publishedAt": "2025-05-09T10:28:13Z",
    "source": "News18",
    "content": "As India-Pak Tensions Rise, Centre Asks States To Activate Emergency Powers: What Does It Mean?\nCurated By :\nNews18.com Edited By: Karishma Jain\nLast Updated: May 09, 2025, 15:58 IST\nIn a new directive, the MHA has asked States and Union Territories ... [5050 chars]"
  },
  {
    "title": "Cyber Alert: Govt Tells RBI, NPCI To Amp Up Security As Tensions Escalate",
    "description": "Govt asks RBI, banks, NPCI to boost cyber security amid India-Pak conflict to protect digital payments and financial systems.",
    "url": "https://www.news18.com/business/markets/cyber-alert-govt-tells-rbi-npci-to-amp-up-security-as-tensions-escalate-9329961.html",
    "publishedAt": "2025-05-09T07:48:51Z",
    "source": "News18",
    "content": "Cyber Alert: Govt Tells RBI, NPCI To Amp Up Security As Tensions Escalate\nCurated By :\nLast Updated: May 09, 2025, 13:18 IST\nGovt asks RBI, banks, NPCI to boost cyber security amid India-Pak conflict to protect digital payments and financial systems.... [2781 chars]"
  },
  {
    "title": "S-400, Akash missiles key to IAF shield against Pakistan missiles and drones",
    "description": "The sources said Pakistan launched a swarm of drones and missiles between 1 am and 1.30 am Thursday morning, with India’s air defence systems immediately tracking the threats and destroying them. The debris is now being recovered from several locations.",
    "url": "https://indianexpress.com/article/explained/s-400-akash-missiles-key-to-iaf-shield-against-pakistan-missiles-and-drones-9991855/",
    "publishedAt": "2025-05-09T00:59:47Z",
    "source": "The Indian Express",
    "content": "India’s flagship surface-to-air missile systems — S400 Triumf, Barak 8 MRSAM (Medium Range Surface to Air Missile) and the indigenous Akash — played a key role as the IAF activated its Integrated Counter UAS (Unmanned Aerial Systems) Grid and other a... [2078 chars]"
  },
  {
    "title": "Cheerleader Recalls Fearful Moments As IPL Match In Dharamshala Abandoned Amid Bomb Threats",
    "description": "Cheerleader recalls panic as IPL match in Dharamshala abandoned.",
    "url": "https://in.mashable.com/culture/93945/ipl-2025-match-between-pbks-and-dc-cancelled-after-security-scare-leaves-fans-and-players-in-shock",
    "publishedAt": "2025-05-08T22:04:52Z",
    "source": "Mashable India",
    "content": "> Culture\nWhat was supposed to be a thrilling evening of cricket at Dharamshala’s picturesque HPCA Stadium turned into a night of fear and confusion, as the IPL 2025 match between Punjab Kings (PBKS) and Delhi Capitals (DC) was abruptly called off du... [2588 chars]"
  },
  {
    "title": "India's S-400 Missile System Blocks Pakistan's Aerial Attack In J&K, Punjab, Rajasthan",
    "description": "The system can intercept targets moving at speeds of up to 4.8 kilometres per second, offering high precision in neutralising fast-moving threats",
    "url": "https://www.news18.com/india/indias-s-400-missile-system-blocks-pakistans-aerial-attack-in-jk-punjab-rajasthan-9329250.html",
    "publishedAt": "2025-05-08T16:06:25Z",
    "source": "News18",
    "content": "India's S-400 Missile System Blocks Pakistan's Aerial Attack In J&K, Punjab, Rajasthan\nCurated By :\nCNN-News18\nLast Updated: May 08, 2025, 21:36 IST\nThe system can intercept targets moving at speeds of up to 4.8 kilometres per second, offering high p... [4542 chars]"
  },
  {
    "title": "How S-400 Missile System, India's Sudarshan Chakra, Thwarted Pakistan's Attack On 15 Cities",
    "description": "Indian Air Force's S-400 systems, nicknamed 'Sudarshan Chakra', intercepted aerial threats from Pakistan on May 7-8, showcasing precision and speed.",
    "url": "https://www.news18.com/india/how-s-400-missile-system-indias-sudarshan-chakra-thwarted-pakistans-attack-on-15-cities-ws-kl-9328893.html",
    "publishedAt": "2025-05-08T16:03:40Z",
    "source": "News18",
    "content": "How S-400 Missile System, India's Sudarshan Chakra, Thwarted Pakistan's Attack On 15 Cities\nCurated By :\nNews18.com Edited By: Apoorva Misra\nLast Updated: May 08, 2025, 21:33 IST\nS-400, one of the most advanced long-range air defence systems, is desi... [4504 chars]"
  },
  {
    "title": "Pakistan targets Jammu with loitering munitions, blackout enforced as India responds with heavy fire",
    "description": "\"Though it’s an evolving situation but we have neutralised all threats coming from Pakistan. So far eight projectiles mostly surface of surface missiles have been shot down by our air defence mechanisms,\" according to a report, citing defence sources",
    "url": "https://www.firstpost.com/india/pakistan-targets-jammu-with-loitering-munitions-jammus-akhnoor-and-kishtwar-under-complete-blackout-13886793.html",
    "publishedAt": "2025-05-08T15:42:41Z",
    "source": "Firstpost",
    "content": "“Though it’s an evolving situation but we have neutralised all threats coming from Pakistan. So far eight projectiles mostly surface of surface missiles have been shot down by our air defence mechanisms,” according to a report, citing defence sources... [2061 chars]"
  },
  {
    "title": "Bhagwant Mann: ‘Operation Sindoor a clear message that India will not tolerate terrorism, threat to sovereignty’",
    "description": "“Punjab is the land of shaheedan (martyrs), faujiyan (soldiers), and kisaans (farmers). So long as we are in-charge, no one will dare destabilise it,” says CM",
    "url": "https://indianexpress.com/article/political-pulse/bhagwant-mann-operation-sindoor-message-india-terrorism-threat-sovereignty-9987959/",
    "publishedAt": "2025-05-08T03:09:54Z",
    "source": "The Indian Express",
    "content": "In an email interview with The Indian Express, Punjab Chief Minister Bhagwant Mann speaks on ‘Operation Sindoor’, India’s response to the Pahalgam terror attack of April 22, Punjab’s water dispute with Haryana and national security, among other issue... [6272 chars]"
  },
  {
    "title": "Apple’s plan to offer AI search options on Safari a blow to Google dominance",
    "description": "Apple's plans to integrate AI-powered search in Safari could reshape the search landscape, posing a major threat to Google's dominance and $20B default search deal.",
    "url": "https://indianexpress.com/article/technology/artificial-intelligence/apples-plan-to-offer-ai-search-options-on-safari-a-blow-to-google-dominance-9989720/",
    "publishedAt": "2025-05-08T02:55:00Z",
    "source": "The Indian Express",
    "content": "Apple’s plans to add AI-powered search options to its Safari browser are a big blow to Google, whose lucrative advertising business relies significantly on iPhone customers using its search engine.\nThe news slammed shares of Google-parent Alphabet, w... [3841 chars]"
  },
  {
    "title": "As Akhilesh says govt ‘anti-Brahmin’, Deputy CM Pathak hits back",
    "description": "During a meeting with a delegation of the Brahmin community at his party office in Lucknow, Yadav said: \"Those in power don't like 'tilak' (indicating Brahmins). They consider the community a political threat and carry out repressive actions against them.\"",
    "url": "https://indianexpress.com/article/cities/lucknow/as-akhilesh-says-govt-anti-brahmin-deputy-cm-pathak-hits-back-9989563/",
    "publishedAt": "2025-05-08T00:32:57Z",
    "source": "The Indian Express",
    "content": "Samajwadi Party president Akhilesh Yadav on Wednesday accused the Yogi Adityanath government in UP of being “anti-Brahmin”, inviting sharp reactions from Deputy Chief Minister Brajesh Pathak, who alleged that the former CM was spreading the poison of... [291 chars]"
  },
  {
    "title": "AI’s threat to Google just got real",
    "description": "A drop in search traffic is a reminder that technological advancement can displace long-established tech giants.",
    "url": "https://www.livemint.com/companies/news/google-search-share-decline-apple-safari-ai-ai-chatbot-impact-search-google-antitrust-lawsuit-eddie-cue-apple-11746704943620.html",
    "publishedAt": "2025-05-07T18:30:00Z",
    "source": "Livemint",
    "content": "A senior Apple executive said Wednesday that Google searches over the Safari web browser fell over the last two months. “That has not happened in over 20 years,\" Eddie Cue, Apple’s senior vice president of services, said on the witness stand during t... [2813 chars]"
  },
  {
    "title": "Bomb Threat Mail For KKR vs CSK IPL Match; CAB Alert Kolkata Police ‘For More Security’ At Eden Gardens",
    "description": "Kolkata Knight Riders vs Chennai Super Kings IPL 2025 match saw tight security due to a bomb threat. No incidents reported.",
    "url": "https://www.news18.com/cricket/bomb-threat-mail-for-kkr-vs-csk-ipl-match-cab-alert-kolkata-police-for-more-security-at-eden-gardens-ws-l-9327807.html",
    "publishedAt": "2025-05-07T17:44:54Z",
    "source": "News18",
    "content": "Bomb Threat Mail For KKR vs CSK IPL Match; CAB Alert Kolkata Police ‘For More Security’ At Eden Gardens\nCurated By :\nLast Updated: May 07, 2025, 23:14 IST\nThe 2025 IPL match between KKR and CSK at Eden Gardens had tight security due to a bomb threat.... [1926 chars]"
  },
  {
    "title": "Operation Sindoor: Orange alert issued, military hospitals in Pune step up vigilance",
    "description": "An Orange alert indicates a high likelihood of a significant security threat or disaster and triggers heightened security protocols. Pune is home to three top military hospitals.",
    "url": "https://indianexpress.com/article/cities/pune/operation-sindoor-orange-alert-issued-military-hospitals-pune-step-up-vigilance-9988946/",
    "publishedAt": "2025-05-07T14:16:21Z",
    "source": "The Indian Express",
    "content": "Military hospitals in Pune have stepped up vigilance and are taking measures to address a developing or a potential critical situation after an Orange alert – as per which authorities have to ‘Be Prepared’ – was issued in the wake of Operation Sindoo... [2873 chars]"
  },
  {
    "title": "India-Pak Tensions: ISI briefs Pakistan PM Shehbaz Sharif on India ‘threat.’ Here’s what we know",
    "description": "India-Pak Tensions: The services chiefs of Pakistan — Chief of Army Staff General Asim Munir, Chief of Naval Staff Admiral Naveed Ashraf and Air Chief Marshal Zaheer Ahmad Babar — were part of the visiting team, as seen in the group photo released on the occasion.",
    "url": "https://www.livemint.com/news/india/indiapak-tensions-isi-briefs-pakistan-pm-shehbaz-sharif-on-india-threat-here-s-what-we-know-11746533859032.html",
    "publishedAt": "2025-05-06T18:47:52Z",
    "source": "Livemint",
    "content": "India-Pak Tensions: Prime Minister of Pakistan Shehbaz Sharif visited the Inter-Services Intelligence (ISI) headquarters in Islamabad on 6 April, Tuesday.\nSharif was accompanied by Deputy Prime Minister/Foreign Minister Ishaq Dar and Defence Minister... [2877 chars]"
  },
  {
    "title": "Mock drill in India on 7 May LIVE: Security beefed up in Delhi, sirens tested in Pune, states prepare for ‘new threats’",
    "description": "Mock drill in India on 7 May LIVE: Amid tensions with Pakistan, MHA has decided to organise Civil Defence Exercise and Rehearsal across 244 categorised districts on May 7. Stay tuned for latest updates on the mock drill.",
    "url": "https://www.livemint.com/news/mock-drill-in-india-on-7th-may-live-updates-civil-defense-list-of-district-cities-tomorrow-india-pakistan-tension-11746536712028.html",
    "publishedAt": "2025-05-06T14:31:00Z",
    "source": "Livemint",
    "content": "Mock drill in India on 7 May LIVE: On Wednesday, 7th May 2025, India will conduct a nationwide mock drill in cities including Delhi, Mumbai, Kolkata, Chennai, Bengaluru, Hyderabad, Ahmedabad, and Pune.\nMock Drill In India on 7th May\nOrganised by the ... [613 chars]"
  },
  {
    "title": "Mock drills planned in nearly 300 'civil defence districts' with sensitive installations",
    "description": "In response to emerging security threats following the recent Pahalgam terror attack, the MHA has ordered mock drills in nearly 300 ‘civil defence districts' across India. These districts contain sensitive installations such as nuclear plants, refineries, and military bases.",
    "url": "https://www.indiatvnews.com/news/india/mock-drills-in-nearly-300-civil-defence-districts-with-sensitive-installations-here-s-what-it-means-2025-05-06-988909",
    "publishedAt": "2025-05-06T11:49:27Z",
    "source": "India TV News",
    "content": "Mock drills in nearly 300 'civil defence districts' with sensitive installations | Here's what it means In response to emerging security threats following the recent Pahalgam terror attack, the MHA has ordered mock drills in nearly 300 ‘civil defence... [2992 chars]"
  },
  {
    "title": "NSG Commandos Reevaluate Security at Shri Jagannath Temple Amid Heightened Safeguards",
    "description": "A four-member NSG team visited Puri's Shri Jagannath Temple for a routine security review. The inspection focused on various security protocols at the high-traffic pilgrimage site. The visit aligns with standard NSG procedures, ensuring preparedness against potential threats.",
    "url": "https://www.devdiscourse.com/article/headlines/3371755-nsg-commandos-reevaluate-security-at-shri-jagannath-temple-amid-heightened-safeguards",
    "publishedAt": "2025-05-06T09:09:32Z",
    "source": "Devdiscourse",
    "content": "On Monday, an elite four-member team of National Security Guard (NSG) commandos conducted a comprehensive security review at the Shri Jagannath Temple in Puri as part of their yearly routine. Speaking to the media, Vinit Agrawal, Superintendent of Po... [1718 chars]"
  },
  {
    "title": "Gangsters’ call, GPS device under SUV: Z-cover for Delhi BJP chief Virendra Sachdeva",
    "description": "Police discovered a portable GPS device attached to the SUV of Delhi BJP chief Virendra Sachdeva during an anti-sabotage check prompted by threats from wanted gangster Nandu. Sachdeva, who is now under ‘Z’ category security, was allegedly contacted by Nandu’s associates. Nandu is notorious for extorting money and is wanted in multiple cases.",
    "url": "https://indianexpress.com/shorts/cities/delhi/gangsters-call-gps-device-under-suv-z-cover-for-delhi-bjp-chief-virendra-sachdeva-9975762/",
    "publishedAt": "2025-05-01T01:00:46Z",
    "source": "The Indian Express",
    "content": "Mumtaz’s in-laws forbade her from acting when she was making Rs 7.5 lakh per film\nEntertainment 9 hr ago This is an AI assisted summary.\nWhile at the top of her game, Mumtaz bid adieu to cinema in the mid '70s to focus on her family and appeared only... [287 chars]"
  },
  {
    "title": "Harvard Under Fire: Federal Funding Freeze Amid Education Policy Clash",
    "description": "Harvard University is facing threats from the U.S. Department of Homeland Security over alleged violations involving foreign students and campus protests. The Trump administration has halted millions in funding and warned of further repercussions. The situation raises concerns about academic freedom under current educational policies.",
    "url": "https://www.devdiscourse.com/article/education/3348991-harvard-under-fire-federal-funding-freeze-amid-education-policy-clash",
    "publishedAt": "2025-04-17T02:01:09Z",
    "source": "Devdiscourse",
    "content": "Harvard University finds itself at the center of a federal funding battle as the U.S. Department of Homeland Security (DHS) demands compliance on issues related to foreign students and campus protests. Secretary Kristi Noem announced the termination ... [679 chars]"
  },
  {
    "title": "Salman Khan on death threats: Jitni Umar Likhi Hai, Utni Likhi Hai",
    "description": "The actor speaks candidly about the impact of heightened security on his daily life amid ongoing threats from the Lawrence Bishnoi gang",
    "url": "https://www.deccanchronicle.com/entertainment/salman-khan-on-death-threats-jitni-umar-likhi-hai-utni-likhi-hai-1869311",
    "publishedAt": "2025-03-27T08:24:00Z",
    "source": "Deccan Chronicle",
    "content": "\"Jitni umar likhi hai, utni likhi hai,\" a philosophical Salman Khan said in his first comments about death threats from the Lawrence Bishnoi gang and the heightened security that has significantly restricted his movements.The security protocol has im... [1772 chars]"
  },
  {
    "title": "Salman Khan Reacts To Lawrence Bishnoi's Death Threats Ahead Of Sikandar Release: 'Jitne Umar Likhi Hai...'",
    "description": "Gunshots were also fired outside Salman Khan's Mumbai apartment last year, following which, the actor's security was stepped up.",
    "url": "https://www.news18.com/movies/salman-khan-reacts-to-lawrence-bishnoi-death-threats-ahead-of-sikandar-release-jitne-umar-likhi-hai-9276548.html",
    "publishedAt": "2025-03-27T05:58:22Z",
    "source": "News18",
    "content": "Salman Khan Reacts To Lawrence Bishnoi's Death Threats Ahead Of Sikandar Release: 'Jitne Umar Likhi Hai...'\nCurated By :\nNews18.com\nLast Updated: March 27, 2025, 11:28 IST\nGunshots were also fired outside Salman Khan's Mumbai apartment last year, fol... [2218 chars]"
  },
  {
    "title": "Salman Khan breaks silence on death threats from Lawrence Bishnoi: ‘Jitni umar likhi hai, utni likhi hai’",
    "description": "Addressing the media ahead of the release of Sikandar, Salman Khan addressed the tight security he has deployed after getting death threats from Lawrence Bishnoi.",
    "url": "https://indianexpress.com/article/entertainment/bollywood/salman-khan-opens-up-on-death-threats-from-lawrence-bishnoi-9908527/",
    "publishedAt": "2025-03-27T05:28:33Z",
    "source": "The Indian Express",
    "content": "Ahead of the release of his long-awaited film Sikandar, Salman Khan caught up with members of the media on Wednesday and addressed the death threats coming his way. The actor has been receiving threats from gangster Lawrence Bishnoi for years now, fo... [2485 chars]"
  }
]